{
  "id": "act-15-1864",
  "type": "statute",
  "title": "The Indian Tolls Act, 1864",
  "short_name": "IT1 1864",
  "status": "in_force",
  "issued_date": "1864-03-24",
  "url": "https://www.indiacode.nic.in/handle/123456789/2267?view_type=browse",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "[Omitted.].",
      "content": "[Schedule of Act 8 of 1851 repealed, and another Schedule substituted].--Omitted by the Devolution Act, 1920 (38 of 1920), s. 2 and the First Schedule (w.e.f. 14-9-1920)."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Collectors of tolls may compound for tolls leviable under Act 8 of 1851 or this Act.",
      "content": "Any person entrusted with the management of the collection of tolls1 under Act 8 of 1851 may in his discretion compound for any period not exceeding one year with any person for a certain sum to be paid by such person for himself or for any vehicle or animal kept by him, in lieu of the rates of toll 2[authorised to be levied under the said Act 8 of 1851].\n\n[Footnote] 1. The Indian Tolls Act, 1851. 2. Subs. by Act 38 of 1920, s. 2 and the First Schedule, for \"specified in the Schedule to the said Act 8 of 1851 or in the Schedule to this Act\"."
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Power to extend Act.",
      "content": "The State Government may extend this1 Act to any place in which the said Act 8 of 1851 is in force; and the State Government of any place in which the said Act 8 of 1851 is not in force may extend the said Act 8 of 1851 and this Act to such place.2\n\n[Footnote] 1. The Act now regulating tolls in the Presidency of Bombay is the Tolls on Roads and Bridges Act, 1875 (Bom. 3 of 1875). That Act repealed Act 8 of 1851 in the Bombay Presidency, see s.1, and declared that Act 15 of 1864 should be deemed to have been extended thereto as from the 30th July, 1864, see s. 2. 2. Act 8 of 1851 and this Act have been extended to Oudh (see Gazette of India, 1865, Pt. I, p.777), the C.P. (see ibid., Pt.I, 1871, p.611) and to the District of Lakhimpur (see Assam Gazette, 1935, Pt. II, p.1025). As to the authority of the Provincial Government in any part of the Provinces, not specified in s. 2 of Act 8 of 1851, to which that Act or this Act may be or have been extended see the Indian Tolls Act, 1888 (8 of 1888), s. 2(1)."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "[Repealed.].",
      "content": "[Interpretation-clause. Local Government].--Rep. by the A.O.1937."
    }
  ],
  "language": "en"
}