{
  "id": "act-19-1838",
  "type": "statute",
  "title": "The Coasting vessels Act, 1838",
  "short_name": "C1 1838",
  "status": "in_force",
  "issued_date": "1838-08-27",
  "url": "https://www.indiacode.nic.in/handle/123456789/2260?view_type=browse",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Extent.",
      "content": "1[1. Extent.--This Act extends in the first instance 2[to the territories which, immediately before the 1st November, 1956, were comprised in the States] of Bombay, Saurashtra and Kutch, but the Central Government may, by notification in the Official Gazette, extend it to any other State 3[or part of a State] which has a sea-coast.]\n\n[Footnote] 1. Ins. by s. 4, ibid. s.1 was rep. by Act 14 of 1870, s. 1 and the Schedule, Pt. II. 2. Subs. by the Adaptation of Laws (No. 2) Order, 1956, for \"to the States\". 3. Ins., ibid."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Rules as to coasting and other vessels belonging to any citizen of India.",
      "content": "2*** The following rules shall be in force with respect to vessels belonging to 3[any citizen of India] 4***, and employed on the coasts of 5[any State] 1[or part of a State] to which this Act extends] or in trading coastwise, as also with respect to fishing-vessels and harbour-craft belonging to 6[any such citizen].\n\n[Footnote] 1. The words and figures \"And it is hereby enacted, that from the said first day of November, 1838\" rep. by Act 16 of 1874, s. 1 and the Schedule, Pt. I. 2. Subs. by the A. O. 1950, for \"any of Her Majesty's subjects\". 3. The words \"residing within the State of Bombay\" omitted by Act 22 of 1952, s. 5. 4. Subs. by s. 5, ibid., for \"the said State\". 5. Ins., ibid. 6. Subs. by the A. O. 1950, for \"any of the same Her Majesty's subjects\"."
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Marking or branding vessels with name of place and number .",
      "content": "1*** Every such vessel employed as aforesaid, fishing-vessel and harbour-craft shall be marked or branded with the name of the place to which she belongs, and also with a number assigned for the same by the officer authorised to make such registry as is hereinafter mentioned. Owner to paint name and number--and the owner or owners of such vessel employed s aforesaid, fishing-vessel and harbour-craft shall cause such name and number to be panted in black paint upon a white ground on each quarter of such vessel employed or aforesaid fishing-vessel and harbour-craft, in English figures and letters, each figure anti letter being six inches in length.\n\n[Footnote] 1. The words \"And it is hereby enacted, that\" rep. by Act. 16 of 1874, s. 1 and the Schedule, Pt. I."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Registry of name, number and burthen.",
      "content": "1*** The name and number of every such vessels employed as aforesaid, fishing-vessel and harbour-craft, and her burthen, and also the name or names of the owner or owners thereof, shall be registered in a took to be kept for that purpose by the person hereinafter directed to make such registry. Registry by whom to be made, Fresh registration.--At Bombay such registry shall be made by the 2[Principal Officer, Mercantile Marine Department], and at other places 3*** by the Collector of Seacustoms at such places respectively, or by such other person as shall be appointed by the 4[Central Government] to act at such places respectively, in the execution of this Act; and whenever any change shall take place in the burthen of such vessel employed as aforesaid, fishing-vessel or harbour-craft, or in the name or names of the owner or owners thereof, such registry shall be made again: Provided, however, that it shall not be lawful to give any name to such vessel employed as aforesaid, fishing-vessel or harbour-craft, other than that by which she was first registered.\n\n[Footnote] 1. The words \"And it is hereby enacted, that\" rep. by Act. 16 of 1874, s. 1 and the Schedule, Pt. I. 2. Subs. by the A. O. 1950 (as amended by C. O. 29, dated 4-4-1951), for \"Master-Attendant\" (w.e.f. 26-1-1950). 3. The words \"within the said State\" omitted by Act 22 of 1952, s. 6. 4. Subs. by the A. O. 1937, for \"Government of Bombay\"."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Owners to apply for registry.",
      "content": "1*** The owner or owners of every such vessel employed as aforesaid, fishing-vessel and harbour-craft shall apply to the person authorised to make such registry in respect of the same, in order to have such registry as aforesaid made, or in order to have such registry made again as aforesaid. Information of registry at subordinate port.--And whenever such vessel employed as aforesaid, fishing-vessel or harbour-craft is registered at a subordinate port, information thereof, and of the number there assigned to her, shall immediately be given by the registering officer to the 2[Principal Officer, Mercantile Marine Department] at Bombay.\n\n[Footnote] 1. The words \"And it is hereby enacted, that\" rep. by Act 16 of 1874, s. 1 and the Schedule, Pt. I. 2. Subs. by A.O. 1950 (as amended by C. O. 29, dated 4-4-1951), for \"Master-Attendent\" (w.e.f. 26 -1-1952)."
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Officers to perform duty of marking and branding.",
      "content": "1*** The duty of marking or branding and of ascertaining the burthen of such vessels employed as aforesaid, fishing-vessels and harbour-craft, at Bombay, shall be performed by the 2[Principal Officer, Mercantile Marine Department]; and at all other places 3*** the duty of marking or branding and of ascertaining the burthen of such vessels employed as aforesaid, fishing-vessels and harbour-craft shall be performed by the Collector of Sea-customs at such places respectively, or by such other persons as shall be appointed by the 4[Central Government] to act at such places respectively, in the execution of this Act.\n\n[Footnote] 1. The words \"And it is hereby enacted, that\" rep. by Act 16 of 1874, s. 1 and the Schedule, Pt. I. 2. Subs. by A.O. 1950 (as amended by C. O. 29, dated 4-4-1951), for \"Master-Attendent\" (w.e.f. 26 -1-1952). 3. The words \"within the State of Bombay\" omitted by Act 22 of 1952, s. 7. 4. Subs. by the A. O. 1937, for \"Government of Bombay\"."
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Owner to obtain certificate of registry. Replacing lost certificate.",
      "content": "1*** The owner or owners of every such vessel employed as aforesaid, fishing-vessel and harbour-craft shall apply for and obtain a certificate of registry from the person authorised to make such registry as aforesaid, and such certificate shall be in the form specified in the Schedule appended to this Act; and in the case of any certificate being lost or destroyed, a renewed certificate may be obtained in the same manner and on payment of the fees hereinafter mentioned.\n\n[Footnote] 1. The words \"And it is hereby enacted, that\" rep. by Act 16 of 1874, s. 1 and the Schedule, Pt. I."
    },
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "Sealing certificate.",
      "content": "1*** Such certificate of registry shall be sealed with the seal of the 2[Government of India], and shall be signed by the person authorised to make such registry.\n\n[Footnote] 1. The words \"And it is hereby enacted, that\" rep. by Act 16 of 1874, s. 1 and the Schedule, Pt. I. 2. Subs. by the A. O. 1950, for \"East India Company\"."
    },
    {
      "provision_ref": "s9",
      "section": "9",
      "title": "[Repealed.].",
      "content": "[Dates for commencement of certificate and registration.] Rep. by the Repealing Act, 1876 (12 of 1876), s. 1 and Sch., Pt. I."
    },
    {
      "provision_ref": "s10",
      "section": "10",
      "title": "Fees for certificates.",
      "content": "1[10. Fees for certificates.--The owner or owners of such vessels employed as aforesaid fishingvessels and harbour-craft being excepted) on being registered as aforesaid, shall pay-- for each certificate of registry for a vessel not exceeding 5 tons burthen, the fee of . . .1 rupee; for each certificate for a vessel exceeding 5 tons burthen and not exceeding 25 tons burthen, the fee of . . . . . . . . . . . . . . .5 rupees; for each certificate for a vessel exceeding 25 tons burthen and not exceeding 100 tons burthen, the fee of. . . . . . . . . . . . . . . . . . 7 rupees; and for each certificate for a vessel of 100 tons or greater burthen, per ton, the fee of . . 2 annas.]\n\n[Footnote] 1. Subs. by Act 22 of 1952, s. 8, for section 10."
    },
    {
      "provision_ref": "s11",
      "section": "11",
      "title": "Fees to be credited to Government.",
      "content": "1*** The person or persons so authorised to make such registry as aforesaid shall receive the fees payable for the same, and shall pay such fees to such officer as 2[the Central Government] shall appoint; the same to be carried to the credit of 3[the Central Government]: 4[Provided that any such fees as immediately before the commencement of 5[the Constitution] were, under this Act as then in force to be carried to the credit of the 6[ 7[State] Government] shall be paid to such officer as the 7[State] Government may appoint and be carried to the credit of that Government.]\n\n[Footnote] 1. The words \"And it is hereby enacted, that\" rep. by Act 16 of 1874, s. 1 and the Schedule, Pt. I. 2. Subs. by the A. O. 1937, for \"the Governor of Bombay in Council\". 3. Subs., ibid., for \"the Government of Bombay\". 4. Ins., ibid. 5. Subs. by the A. O. 1950, for \"Part III of the Government of India Act, 1935\". 6. Subs. ibid., for \"Local Government\". 7. Subs. by A.O. 1950, for \"Provicial\"."
    },
    {
      "provision_ref": "s12",
      "section": "12",
      "title": "Production of certificate on demand.",
      "content": "1*** The owner or owners or commander of every such vessel employed as aforesaid, fishing-vessel and harbour-craft shall produce, on demand thereof by any officer of the Customs 2*** or by any officer of the 3*** Navy, the certificate so directed to be applied for and obtained, in respect of such vessel employed as aforesaid, fishing-vessel or harbourcraft, as above mentioned.\n\n[Footnote] 1. The words \"And it is hereby enacted, that\" rep. by Act 16 of 1874, s. 1 and the Schedule, Pt. I. 2. The words \"within the said State\" omitted by Act 22 of 1952, s. 6. 3. The word \"Indian\" rep. by Act 12 of 1876, s. 1 and the Schedule., Pt. I."
    },
    {
      "provision_ref": "s13",
      "section": "13",
      "title": "Penalty for neglect to comply with rules .",
      "content": "1*** Incase any such vessel employed as aforesaid, fishing-vessel or harbour-craft shall not be so marked or branded in all respects as hereinbefore directed, or in case the name and number of any such vessel employed as afored said, fishing-vessel or harbour-craft shall not be so painted, or shall not continue so painted on such vessel employed as aforesaid, fishing-vessel or harbour-craft, in all respects as herein before directed; or in case any such vessel employed as aforesaid, fishing-vessel or harbour-craft shall not be furnished with such certificate as hereinbefore specified, or in case the owner or owners or commander of any such vessel employed as aforesaid, fishing-vessel or harbour-craft shall not produce such certificate on demand thereof as hereinbefore directed; the owner or owners of every such vessel employed as aforesaid shall be subject to a fine of ten times the amount of the fees payable in respect of the certificate of registry of such vessel, the same being a vessel for the certificate of the registration of which any fee is payable; and the owner or owners of any such fishing-vessel or harbour-craft shall be subject to a fine of ten rupees; Recovery of penalties--which fines may be recovered on conviction before any Magistrate 3*** having jurisdiction, 2*** by sale of such vessel, fishing-vessel or harbour-craft, her furniture, ammunition, tackle and apparel; Penalty on repetition of default--and such fines shall be payable as often as the owner or owners or commander of any such vessel employed as aforesaid, fishing-vessel or harbour-craft shall make such default as aforesaid: Provided every such subsequent default be made after the expiration of one month from the date of the last conviction.\n\n[Footnote] 1. Subs. by A.O. 1950, for \"Provicial\". 2. The words \"And it is hereby enacted\", that rep. by Act 16 of 1874, s. 1 and the Schedule, Pt. I. 3. The words \"Justice of the Peace, or person exercising the powers of a Magistrate\" rep. by Act 12 of 1876, s. 1 and the Schedule, Pt. I."
    },
    {
      "provision_ref": "s14",
      "section": "14",
      "title": "Power to direct compensation for trouble in seizing .",
      "content": "1*** The 2[Central Government] may direct compensation for trouble and diligence in seizing such vessel employed as aforesaid, fishing-vessel or harbour-craft, guns, furniture, tackle, ammunition and apparel, as last mentioned, to be made, out of the proceeds of such seizure to the person or persons who shall have seized the same, to such amount, in such manner and in such shares or proportions, as to the said 3Central Government shall seem meet.\n\n[Footnote] 1. Subs. by A.O. 1950, for \"Provicial\". 2. Subs. by the A. O. 1937, for \"Governor of Bombay in Council\". 3. Subs., ibid., for \"Governor in Council\"."
    },
    {
      "provision_ref": "s15",
      "section": "15",
      "title": "[Repealed.].",
      "content": "[Port-clearance.] Rep. partly by the Repealing Act, 1874 (16 of 1874), s. 1 and Sch., Pt. I, and partly by the Repealing Act, 1876 (12 of 1876), s. 1 and Sch., Pt. I."
    }
  ],
  "language": "en"
}