{
  "id": "act-21-2000",
  "type": "statute",
  "title": "The Information Technology Act, 2000",
  "short_name": "IT Act 2000",
  "status": "in_force",
  "issued_date": "2000-06-09",
  "url": "https://www.indiacode.nic.in/handle/123456789/1999",
  "description": "India's primary legislation dealing with cybercrime and electronic commerce. Provides legal recognition for transactions carried out by electronic data interchange.",
  "provisions": [
    {"provision_ref": "sec43A", "section": "43A", "title": "Compensation for failure to protect data", "content": "Where a body corporate, possessing, dealing or handling any sensitive personal data or information in a computer resource which it owns, controls or operates, is negligent in implementing and maintaining reasonable security practices and procedures and thereby causes wrongful loss or wrongful gain to any person, such body corporate shall be liable to pay damages by way of compensation to the person so affected.", "chapter": "Chapter IX - Penalties, Compensation and Adjudication"},
    {"provision_ref": "sec66", "section": "66", "title": "Computer related offences", "content": "If any person, dishonestly or fraudulently, does any act referred to in section 43, he shall be punishable with imprisonment for a term which may extend to three years or with fine which may extend to five lakh rupees or with both.", "chapter": "Chapter XI - Offences"},
    {"provision_ref": "sec69", "section": "69", "title": "Powers to issue directions for interception or monitoring", "content": "Where the Central Government or a State Government or any of its officers specially authorised by the Central Government or the State Government, as the case may be, in this behalf may, if satisfied that it is necessary or expedient so to do, in the interest of the sovereignty or integrity of India, defence of India, security of the State, friendly relations with foreign States or public order or for preventing incitement to the commission of any cognizable offence relating to above or for investigation of any offence, direct any agency of the appropriate Government to intercept, monitor or decrypt any information generated, transmitted, received or stored in any computer resource.", "chapter": "Chapter XI - Offences"},
    {"provision_ref": "sec72A", "section": "72A", "title": "Punishment for disclosure of information in breach of lawful contract", "content": "Save as otherwise provided in this Act or any other law for the time being in force, any person including an intermediary who, while providing services under the terms of lawful contract, has secured access to any material containing personal information about another person, with the intent to cause or knowing that he is likely to cause wrongful loss or wrongful gain discloses, without the consent of the person concerned, or in breach of a lawful contract, such material to any other person, shall be punished with imprisonment for a term which may extend to three years, or with fine which may extend to five lakh rupees, or with both.", "chapter": "Chapter XI - Offences"},
    {"provision_ref": "sec79", "section": "79", "title": "Exemption from liability of intermediary", "content": "An intermediary shall not be liable for any third party information, data, or communication link made available or hosted by him if he observes due diligence while discharging his duties and also observes such other guidelines as the Central Government may prescribe.", "chapter": "Chapter XII - Intermediaries not to be liable in certain cases"}
  ]
}
