{
  "id": "act-7-1839",
  "type": "statute",
  "title": "The Madras Rent and Revenue Sales Act, 1839",
  "short_name": "MRRS1 1839",
  "status": "in_force",
  "issued_date": "1839-03-18",
  "url": "https://www.indiacode.nic.in/handle/123456789/19545?view_type=browse",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "[Repealed.].",
      "content": "1. [Repeal of Reg. XXVIII of 1802, s. 23] Rep., Act XIV of 1874."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Tahsildars empowered to sell property distrained.",
      "content": "1**** All tahsildars within the territories subject to the Presidency of Fort St. George shall be vested with the powers of Commissioners for the sale of property distrained for arrears of rent or of revenue, and shall be subject to all rules and provisions to which by any law or regulation such Commissioners are subject.\n\n[Footnote] 1. The words “And it is hereby enacted that from the said day” were repealed by the Repealing Act, 1873 (XII of 1873)."
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Control of tahsildars in exercise of such power.",
      "content": "Provided always that in respect of the exercise of those powers tahsildars shall be subject to the control and superintendence of the Collector, and shall not be subject to the authority of the Zila Judge, except in the case of any judicial proceedings."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Repealed..",
      "content": "4. [Their liabilities in exercise of same power.] Rep. by the Repealing and Amending Act, 1891 (XII of 1891)."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Fees for selling property to be credited to Government.",
      "content": "Provided also that tahsildars shall not be entitled to any fee or commission for selling such distrained property; but that all fees or commission which may be now lawfully taken by Commissioners for the sale of such distrained property shall be taken and carried to the account of Government."
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Delegation of tahsildars powers.",
      "content": "And it is herby enacted that tahsildars shall have authority, subject to the orders of the Collector, to delegate the powers vested in them by the second section of this Act to any public servants placed under their authority; and that the provisions of 1[sections 3 and 5] of this Act shall apply to all public servants to whom those powers shall have so delegated in the same manner as they apply to tahsildars.\n\n[Footnote] 1. The words and figures in square brackets have been substituted for the words “the three last proceeding sections” by the Amending Act, 1801 (XII of 1891). General Acts, Vol. IV."
    }
  ],
  "language": "en"
}